Repository: quintrrr/QuizDuel
Catalog: QuizDuel.UI/Resources.*.resx
Languages: tt

# BirthdateLabel
source: Birthdate
tt: Туган көн

# ConfirmExitGameMessage
source: Do you really want to exit the game?
tt: Уйныннан чынлап та чыгарга телисезме?

# ConformExitGame
source: Exit Confirmation
tt: Чыгуны раслау

# CreateGameButton
source: Create Game
tt: Уен булдыру

# Game.AnotherTurn
source: It's the other player's turn
tt: Хәзер башка уенчының ходы

# Game.AnswerError
source: Error while submitting answer
tt: Сорауга җавап биргәндә хата чыкты

# Game.CreateError
source: Failed to create game
tt: Уенны булдыру мөмкин түгел

# Game.Draw
source: Draw
tt: Ничья

# Game.Finished
source: The game is already finished
tt: Уен инде тәмамланган

# Game.IsNotFound
source: Game not found
tt: Уен табылмады

# Game.JoinButton
source: Join
tt: Кушылу

# Game.JoinError
source: Error joining game
tt: Уенга кушылганда хата

# Game.LoadCategoryError
source: Failed to load categories
tt: Категорияләрне йөкләгәндә хата

# Game.LoadError
source: Failed to load game
tt: Уенны йөкләп булмады

# Game.LoadQuestionsError
source: Failed to load questions
tt: Сорауларны йөкләп булмады

# Game.NotStarted
source: The second player hasn't joined yet
tt: Икенче уенчы әле кушылмаган

# Game.PasTurnError
source: Error passing turn
tt: Ходны тапшыру хатасы

# Game.Play
source: Play
tt: Уйнарга

# Game.PlayerWon
source: Player won
tt: Уенчы җиңде

# Game.SamePlayers
source: You cannot join your own game
tt: Сез үз уеныгызга кушыла алмыйсыз

# Game.SelectCategory
source: Select a category
tt: Категорияне сайлагыз

# Game.StateError
source: Could not join game
tt: Уенга кушылып булмады

# Join.UpdateError
source: Failed to load games
tt: Уеннарны йөкләп булмады

# Join.UpdateGames
source: Refresh
tt: Яңарту

# JoinGameButton
source: Join a Game
tt: Уенга кушылу

# Leaderboard.Answers
source: correct answers
tt: дөрес җаваплар

# Leaderboard.Label
source: Leaderboard
tt: Лидерлар таблицасы

# Login.BtnLogin
source: Login
tt: Керү

# Login.EmptyUsername
source: Please enter a username
tt: Кулланучы исемен языгыз

# Login.Error
source: Error while logging in
tt: Аккаунтка кергәндә хата

# Login.NoAccount
source: No account?
tt: Аккаунтыгыз юкмы?

# Login.NonExistingUser
source: User does not exist
tt: Мондый кулланучы юк

# Login.Success
source: Login successful
tt: Аккаунтка уңышлы керү

# Login.WrongPassword
source: Incorrect password
tt: Ялгыш пароль

# Notification.Error
source: Error Notification
tt: Хата турында хәбәр

# Notification.Info
source: Information
tt: Мәгълүмат

# Notification.Success
source: Success
tt: Уңышлы гамәл

# Password.HasLowerChar
source: Password must contain at least one lowercase letter
tt: Пароль должен содержать хотя бы одну строчную букву

# Password.HasNumber
source: Password must contain at least one number
tt: Пароль должен содержать хотя бы одну цифру

# Password.HasSymbols
source: Password must contain at least one special character
tt: Пароль должен содержать хотя бы один специальный символ

# Password.HasUpperChar
source: Password must contain at least one uppercase letter
tt: Пароль должен содержать хотя бы одну заглавную букву

# Password.IsLatinOnly
source: Password must contain only Latin letters
tt: Пароль должен содержать только латинские буквы

# Password.MinMaxChar
source: Password must be between 8 and 20 characters
tt: Пароль должен быть не менее 8 и не более 20 символов

# PasswordLabel
source: Password
tt: Серсүз

# Player1Label
source: Player 1
tt: Уенчы 1

# Player2Label
source: Player 2
tt: Уенчы 2

# Register.EmptyPassword
source: Please enter a password
tt: Серсүзне языгыз

# Register.EmptyRepeatPassword
source: Please confirm your password
tt: Серсүзне кабат языгыз

# Register.EmptyUsername
source: Please enter a username
tt: Кулланучы исемен языгыз

# Register.Error
source: Error registering account
tt: Аккаунтны теркәү хатасы

# Register.ExistingUser
source: User already exists
tt: Мондый кулланучы инде бар.

# Register.HaveAnAccount
source: Already have an account?
tt: Аккаунтыгыз бармы?

# Register.InvalidAge
source: You must be at least 4 years old
tt: Сезгә ким дигәндә 4 яшь булырга тиеш

# Register.InvalidRepeatPassword
source: Passwords must match
tt: Серсүзләр туры килергә тиеш

# Register.Successful
source: Registration successful
tt: Теркәү уңышлы узды

# RegisterButton
source: Register
tt: Теркәү

# RepeatPasswordLabel
source: Repeat Password
tt: Серсүзне кабатлагыз

# UsernameLabel
source: Username
tt: Кулланучы исеме
